{
  "knowledge_piece_name": "Catalog of Pivots",
  "main_category": "Human Systems & Strategy",
  "subcategory": "Business & Management",
  "hook": "Remember when Instagram was just a check-in app called Burbn? That strategic shift wasn't random—it was one of ten specific pivot types that can save a failing startup.",
  "definition": "The Catalog of Pivots is a framework of ten distinct strategic transformations a startup can execute when their current approach isn't working, each testing a new fundamental hypothesis about the product, business model, or growth engine.",
  "analogy_or_metaphor": "Think of it as a restaurant's emergency menu—when your signature dish isn't selling, you have ten proven recipes to completely reimagine your offering without starting from scratch.",
  "key_takeaway": "**A pivot isn't just change—it's a structured shift to test a new core assumption while preserving what you've learned.**",
  "classic_example": "Potbelly Sandwich Shop started as an antique store in 1977, selling sandwiches to attract customers. The sandwiches became so popular they pivoted entirely into the restaurant business, now operating over 200 stores.",
  "modern_example": "Slack pivoted from a gaming company called Tiny Speck into a messaging platform when they realized their internal communication tool was more valuable than the game they were building.",
  "pitfall": "Without a structured pivot framework, founders either cling to failing ideas too long or make random changes that waste previous learnings and resources.",
  "payoff": "Using the catalog of pivots helps you make strategic course corrections that preserve your team's learning while testing fundamentally new directions for growth.",
  "visual_metaphor": "A compass with ten distinct directional arrows radiating from a central point, each arrow labeled with a different pivot type, showing how a startup can systematically explore new strategic directions.",
  "dive_deeper_mechanism": "The Catalog of Pivots works by providing structured options for transformation when initial hypotheses fail. Rather than random experimentation, it offers ten specific ways to leverage existing assets, knowledge, and capabilities in new configurations. Each pivot type preserves certain elements (team expertise, technology, customer relationships) while fundamentally changing others (target market, product scope, business model). This systematic approach reduces the emotional and cognitive burden of major strategic changes while maximizing the chances of finding product-market fit.",
  "dive_deeper_origin_story": "Eric Ries codified the Catalog of Pivots in 'The Lean Startup' after observing patterns in how successful startups transformed themselves. Drawing from Geoffrey Moore's business architecture concepts and countless startup case studies, Ries recognized that successful pivots weren't random acts of desperation but followed predictable patterns. The framework emerged from the lean startup methodology's emphasis on validated learning—treating each pivot as a structured experiment rather than an admission of failure.",
  "dive_deeper_pitfalls_nuances": "**Common Misconception:** Any change in strategy is a pivot. **Reality:** A true pivot maintains a strategic hypothesis while changing the tactics—it's not starting over but redirecting based on validated learning. **Nuance Often Missed:** Multiple pivots may be necessary, and some companies like Twitter executed several pivot types simultaneously. The key is maintaining enough runway to test each new hypothesis properly rather than pivoting frantically without gathering sufficient data.",
  "extra_content": "## The Ten Types of Pivots\n\n### 1. **Zoom-in Pivot**\nA single feature becomes the entire product.\n- **When to use:** One feature gets overwhelming user engagement while others are ignored\n- **Example:** Burbn → Instagram (photo-sharing feature became the whole product)\n\n### 2. **Zoom-out Pivot**\nThe current product becomes just one feature of a larger product.\n- **When to use:** Your product solves too narrow a problem to sustain a business\n- **Example:** A note-taking app becoming part of a full productivity suite\n\n### 3. **Customer Segment Pivot**\nSame product, different target customers.\n- **When to use:** Product solves a real problem but for different users than intended\n- **Example:** Groupon pivoted from social activism platform to deal aggregator\n\n### 4. **Customer Need Pivot**\nSame customers, different problem.\n- **When to use:** Deep customer knowledge reveals more important problems to solve\n- **Example:** Potbelly pivoting from antiques to sandwiches\n\n### 5. **Platform Pivot**\nChange from application to platform or vice versa.\n- **When to use:** Third parties want to build on your technology, or your platform needs a killer app\n- **Example:** Shopify started as an online snowboard shop before becoming an e-commerce platform\n\n### 6. **Business Architecture Pivot**\nSwitch between high margin/low volume and low margin/high volume.\n- **When to use:** Your sales model doesn't match your market reality\n- **Example:** Moving from enterprise B2B to consumer B2C model\n\n### 7. **Value Capture Pivot**\nChange how you make money (monetization model).\n- **When to use:** Users love the product but won't pay, or you're leaving money on the table\n- **Example:** Moving from freemium to subscription, or from one-time purchase to SaaS\n\n### 8. **Engine of Growth Pivot**\nChange between viral, sticky, or paid growth strategies.\n- **When to use:** Current growth engine is too expensive or slow\n- **Example:** Shifting from paid advertising to viral referral mechanisms\n\n### 9. **Channel Pivot**\nChange the primary path to customers.\n- **When to use:** Current distribution channel is too expensive or ineffective\n- **Example:** Moving from retail stores to direct-to-consumer online sales\n\n### 10. **Technology Pivot**\nUse different technology to achieve the same solution.\n- **When to use:** New technology enables better/cheaper/faster delivery of value\n- **Example:** Moving from native apps to progressive web apps\n\n## How to Execute a Pivot\n\n1. **Identify failure signals:**\n   - Diminishing product/market fit metrics\n   - Plateauing growth despite effort\n   - High customer acquisition costs\n\n2. **Choose pivot type based on strengths:**\n   - What's working? (preserve this)\n   - What's not working? (change this)\n   - Match the pattern to one of the ten types\n\n3. **Test the new hypothesis:**\n   - Define success metrics for the pivot\n   - Set a timeline for evaluation\n   - Preserve ability to pivot again if needed\n\n4. **Communicate clearly:**\n   - Explain the 'why' to team and investors\n   - Frame as evolution, not failure\n   - Maintain momentum through the transition",
  "source_file": "Catalog of Pivots.md",
  "target_persona": [
    "founder",
    "executive"
  ],
  "startup_phase": [
    "seed",
    "growth",
    "crisis"
  ],
  "problem_category": [
    "pivot",
    "product-market_fit",
    "competitive_strategy"
  ]
}