{
  "knowledge_piece_name": "Naming Formula (M-A-G-I-C)",
  "main_category": "Thinking & Learning Processes",
  "subcategory": "Communication & Persuasion",
  "hook": "Ever wonder why a \"Time Management Course\" sells for $19, but \"Time Management for B2B Outbound Power Tools Sales Reps\" commands $2,000?",
  "definition": "The M-A-G-I-C naming formula is a structured approach to creating compelling offer names using five key elements: Magnetic reason why, Avatar (specific target), Goal (desired outcome), time Interval, and Container word.",
  "analogy_or_metaphor": "Think of naming like laser focus versus a flashlight - a generic flashlight illuminates everything weakly, but a laser beam focused on a specific point can cut through steel.",
  "key_takeaway": "**Specificity creates scarcity, and scarcity commands premium pricing.**",
  "classic_example": "Dan Kennedy's transformation of a generic \"Time Management Course\" ($19) into \"Time Management for B2B Outbound Power Tools & Gardening Sales Reps\" ($1,000-$2,000) - identical content, dramatically different value perception.",
  "modern_example": "Instead of offering \"Social Media Marketing,\" positioning it as \"Instagram Growth System for Local Restaurant Owners to Fill Tables in 30 Days\" - same strategies, but the specific avatar and outcome make it irresistibly relevant.",
  "pitfall": "Generic naming makes your offer blend into the noise, forcing you to compete on price rather than value, leaving money on the table.",
  "payoff": "Precise naming using M-A-G-I-C makes prospects think \"This is made exactly for me,\" allowing you to charge premium prices for the same content.",
  "visual_metaphor": "A sniper's crosshairs zooming in from a wide cityscape to focus precisely on a single target - each level of specificity increases impact and value.",
  "dive_deeper_mechanism": "The M-A-G-I-C formula works by leveraging psychological specificity bias - when people see something designed specifically for their exact situation, their perceived value skyrockets. The brain interprets specificity as expertise and relevance. A B2B sales rep sees 'Time Management for B2B Sales Reps' and immediately thinks the creator understands their unique challenges, pain points, and context better than a generic time management expert. This specificity also creates artificial scarcity - there are millions seeking time management help, but far fewer B2B power tools sales reps, making the offer feel more exclusive and valuable.",
  "dive_deeper_origin_story": "This concept was popularized by direct marketing legend Dan Kennedy, who demonstrated it to Alex Hormozi in a way that \"changed his life forever.\" Kennedy had observed that the same information packaged generically would sell for pocket change, but when precisely targeted to a specific avatar with their exact goals and constraints, the same content could command 100x higher prices. The breakthrough came from realizing that people don't just buy information - they buy the feeling that someone truly understands their specific situation and has crafted a solution just for them.",
  "dive_deeper_pitfalls_nuances": "**Common mistake:** Going too broad with your avatar thinking you'll capture more customers, when specificity actually increases both conversion rates and pricing power. **Reality:** The narrower your focus, the wider your appeal to that specific group. **Another pitfall:** Thinking the content needs to be completely different for each niche - often 80% of the content remains the same, but the examples, case studies, and language are tailored to speak directly to that avatar's world.",
  "source_file": "Naming Formula (M-A-G-I-C).md",
  "target_persona": [
    "founder",
    "product_manager"
  ],
  "startup_phase": [
    "ideation",
    "seed",
    "growth"
  ],
  "problem_category": [
    "go-to-market",
    "product-market_fit"
  ]
}