{
  "knowledge_piece_name": "Sustainable Growth Rule",
  "main_category": "Human Systems & Strategy",
  "subcategory": "Business & Management",
  "hook": "Ever wonder why some companies grow steadily while others burn through marketing budgets with nothing to show for it?",
  "definition": "The Sustainable Growth Rule states that all lasting business growth is characterized by one simple principle: new customers come from the actions of past customers, not from one-time marketing stunts or external funding.",
  "analogy_or_metaphor": "Think of sustainable growth like a campfire that feeds itself—each burning log creates sparks that ignite new logs, creating a self-sustaining cycle rather than needing constant external fuel.",
  "key_takeaway": "**True growth creates its own momentum—satisfied customers become your growth engine.**",
  "classic_example": "TiVo's early growth came from customers who couldn't stop telling friends and family about the product, creating natural word-of-mouth that required no advertising spend.",
  "modern_example": "When you send money through Venmo, your friends automatically see the transaction and discover the app—each use naturally exposes new potential customers without any marketing effort.",
  "pitfall": "Relying on paid advertising or publicity stunts creates unsustainable growth spurts that disappear once the funding stops, leaving you back at square one.",
  "payoff": "Building sustainable growth mechanisms means your business becomes self-reinforcing, reducing marketing costs while creating compound growth that accelerates over time.",
  "visual_metaphor": "A perpetual motion machine where satisfied customers act as gears that turn other gears, each rotation generating the energy to keep the entire system spinning faster.",
  "dive_deeper_mechanism": "The Sustainable Growth Rule works because it creates positive feedback loops that compound over time. Unlike paid acquisition which stops when funding stops, customer-driven growth becomes more efficient as it scales. Each satisfied customer doesn't just represent one sale—they become a growth asset that continues generating value through recommendations, usage visibility, repeat purchases, or funded advertising (where profits from existing customers pay for acquiring new ones). This creates what Eric Ries calls 'engines of growth'—self-reinforcing mechanisms that turn faster as more customers join the system.",
  "dive_deeper_origin_story": "Eric Ries formalized this principle in 'The Lean Startup' after observing countless startups that achieved temporary growth through marketing blitzes but couldn't sustain it. He noticed that companies like Facebook, PayPal, and other successful startups had cracked the code of making their existing customers do the work of acquiring new ones. The rule emerged from studying why some companies could grow exponentially with minimal external funding while others burned through millions without creating lasting momentum.",
  "dive_deeper_pitfalls_nuances": "**Common Misconception:** Any customer referral counts as sustainable growth. **Reality:** The growth must be intrinsic to your product's value, not artificially incentivized through expensive referral programs. **Nuance:** Not all businesses can achieve viral growth—some rely on repeat purchases or profitable advertising funded by existing customer revenue, which is still sustainable growth as long as the unit economics work long-term.",
  "source_file": "Sustainable Growth Rule.md",
  "target_persona": [
    "founder",
    "executive"
  ],
  "startup_phase": [
    "growth",
    "scale-up"
  ],
  "problem_category": [
    "go-to-market",
    "competitive_strategy",
    "product-market_fit"
  ]
}