{
  "knowledge_piece_name": "The \"Seesaw\" Downsell",
  "main_category": "Human Systems & Strategy",
  "subcategory": "Communication & Persuasion",
  "hook": "Ever notice how asking \"Would you rather have giant monthly payments or tiny ones?\" instantly makes the full price seem like the better deal?",
  "definition": "The Seesaw Downsell is a collaborative payment negotiation technique that frames payment plans as less desirable while positioning upfront payment as the smart choice, then adjusts the down payment like a seesaw—the more you put down now, the lower your monthly payments become.",
  "analogy_or_metaphor": "Like a playground seesaw where one side is the down payment and the other is monthly payments—push one side down (increase down payment) and the other automatically goes up (lower monthly payments), creating a visual balance that makes the trade-off crystal clear.",
  "key_takeaway": "**Frame payment plans as the expensive option, then make finding the right balance a collaborative effort rather than a negotiation.**",
  "classic_example": "A car salesman asking \"Would you rather pay $800/month or $200/month?\" then revealing that $200 requires a larger down payment, making the customer feel they're choosing their own payment structure rather than being sold to.",
  "modern_example": "A SaaS company offering their annual plan by asking \"Do you want large monthly payments or no monthly payments at all?\" then presenting the discounted yearly price as the way to achieve zero monthly burden.",
  "pitfall": "Without this technique, payment plan discussions become adversarial negotiations where customers feel pressured and salespeople lose deals over price objections.",
  "payoff": "Using the Seesaw approach transforms price objections into collaborative problem-solving sessions, closing more deals while maintaining higher profit margins through larger down payments.",
  "visual_metaphor": "A simple seesaw diagram with dollar signs—one side labeled \"Down Payment\" touching the ground (heavy), the other side labeled \"Monthly Payments\" up in the air (light), with an arrow showing how they balance.",
  "dive_deeper_mechanism": "The Seesaw Downsell works through several psychological principles. First, it uses **anchoring bias** by starting with an extreme choice (giant vs. tiny payments) that makes any middle ground seem reasonable. Second, it employs **loss aversion** by framing payment plans as losing the prepay discount rather than gaining flexibility. Third, it creates **collaborative framing** by literally moving to the customer's side of the table, transforming the dynamic from \"me vs. you\" to \"us vs. the problem.\" The technique also leverages **commitment consistency**—once customers say they want tiny payments, they're psychologically committed to finding a way to achieve that, even if it means a larger down payment.",
  "dive_deeper_origin_story": "This technique emerged from Alex Hormozi's experience closing thousands of gym membership and business service deals. After testing multiple payment plan approaches, he discovered that traditional negotiations where salespeople defended price created resistance. The breakthrough came when he reframed the conversation entirely—instead of negotiating price, he made payment structure a collaborative choice. The name \"Seesaw\" captures the visual simplicity of the trade-off: customers immediately understand that pushing down one side (down payment) lifts the other (monthly payments). This approach helped Hormozi's Gym Launch business scale to $100M+ by converting price objections into closed deals.",
  "dive_deeper_pitfalls_nuances": "**Common Mistake #1:** Offering payment plans too quickly. The Seesaw only works after establishing value—if you jump to payment options immediately, it signals desperation. **Common Mistake #2:** Making it feel manipulative by being too rigid with the \"script.\" The power comes from genuine collaboration, not clever wording. **Nuance:** This technique works best for high-ticket offers where payment plans are common. For low-ticket items, it can overcomplicate the sale. **Advanced tip:** After someone chooses a payment plan, periodically offer them the original prepay discount if they pay off the balance—many will take this \"second chance\" offer, improving cash flow.",
  "extra_content": "## The Seesaw Downsell Implementation Framework\n\n### Step-by-Step Process\n\n**Step 1: The Opening Question**\n- Ask: \"Would you rather have giant monthly payments or tiny ones?\"\n- Wait for response (99% will say \"tiny\")\n- This creates the psychological anchor\n\n**Step 2: Present the Prepay Option**\n- Say: \"Great! The program normally costs $X. If you prepay it today, you get a huge discount bringing it to $Y, and you'll have zero monthly payments. How does that work for you?\"\n- This frames prepayment as achieving their stated goal (tiny/no payments)\n\n**Step 3: The Seesaw Adjustment (if needed)**\nIf they object to the full prepayment:\n- Say: \"I totally get it. Here's how we can make this work—the more you can put down today, the lower your monthly payments will be. Let's find the right balance for you.\"\n- Physically move to their side of the table (if in person)\n- Open a calculator or spreadsheet\n\n**Step 4: Collaborative Calculation**\nWork through options together:\n- \"If you put down $X, your monthly payment would be $Y\"\n- \"If you put down $X+1000, your monthly drops to $Y-100\"\n- Let them see the seesaw effect in real-time\n\n### Payment Structure Options\n\n**Option A: 50% Down**\n- Down payment: 50% of total\n- Monthly: Remaining 50% over service period\n- Frame as: \"Half now, tiny payments\"\n\n**Option B: 25% Down**\n- Down payment: 25% of total\n- Monthly: 75% over service period\n- Frame as: \"Manageable start, moderate payments\"\n\n**Option C: Minimum Down**\n- Down payment: First month's value\n- Monthly: Full monthly rate\n- Frame as: \"The minimum to get started\"\n\n### The Collaboration Script\n\n\"Let me grab my calculator and we'll figure this out together. What's the maximum you could comfortably put down today if it meant having those tiny monthly payments you want?\"\n\n[Customer gives number]\n\n\"Perfect. With that down payment of $X, your monthly would be $Y. How does that feel?\"\n\n[If too high]: \"No problem. If we increased the down payment to $X+500, that would drop your monthly to $Y-50. Would that work better?\"\n\n[Continue adjusting until you find their sweet spot]\n\n### Advanced Techniques\n\n**1. The Future Payoff Opportunity**\nDuring payment plan period, offer:\n- \"You can still get the original prepay discount if you pay off your balance anytime\"\n- Send this reminder monthly\n- 20-30% typically take this offer\n\n**2. Align with Paydays**\n- Ask: \"Do you get paid on the 1st and 15th, or every other Friday?\"\n- Schedule payments for day after payday\n- Reduces declined payments by 30-40%\n\n**3. The Minimum Package Close**\nFor final hesitation:\n- \"So nothing more than the minimum package then?\"\n- Uses rejection to get acceptance\n- Makes minimum feel like baseline, not discount\n\n### Calculation Formula\n\n**Monthly Payment = (Total Price - Down Payment) ÷ Number of Months**\n\n**Prepay Discount = Total Price × Discount Percentage**\n\n**Break-even Analysis:**\n- If customer pays over time: Total Revenue = Full Price\n- If customer prepays: Total Revenue = Price - Discount\n- Calculate based on your cash flow needs\n\n### When NOT to Use Seesaw\n\n- Products under $500 (overcomplicates)\n- One-time transactions with no service period\n- When customer has explicitly stated they want to finance\n- B2B sales with procurement departments (they have fixed processes)\n\n### Success Metrics\n\n- **Conversion Rate**: Should see 15-25% increase in close rate\n- **Average Down Payment**: Target 30-40% of total price\n- **Payment Completion**: 85%+ should complete all payments\n- **Prepay Conversions**: 20-30% should take prepay offer during plan",
  "source_file": "The \"Seesaw\" Downsell.md",
  "target_persona": [
    "founder",
    "executive"
  ],
  "startup_phase": [
    "seed",
    "growth",
    "scale-up"
  ],
  "problem_category": [
    "fundraising",
    "go-to-market",
    "pricing"
  ]
}